export function JapaneseTerms() {
  return (
    <div className="space-y-6">
      <div>
        <h2 className="text-2xl font-bold mb-4">会員規約</h2>
      </div>

      <div>
        <h3 className="text-lg font-semibold mb-3">
          第１条 <span className="ml-2">適用</span>
        </h3>
        <p className="text-gray-700">
          <ol className="list-decimal list-outside space-y-2 text-gray-700 ml-4">
            <li>
              本規約は、合同会社HiveMinds（以下、「当社」といいます。）が運営する「Survey
              Rewards」での調査サービスおよびその他調査サービス（以下、「本サービス」といいます。）の利用に関して、第2条に定めるところにより当社が登録を承認したネットリサーチユーザー（以下、「ユーザー」といいます。）と当社との間における一切の権利義務関係に適用されます。
            </li>
            <li>
              本サービスは、当社が、当社またはユーザーのためにリサーチサービスを行う目的で、当社が運営するウェブサイト（以下、「本サイト」といいます。）上に調査のためのアンケートを設け、当社が定めるアンケート回答者（以下、「回答者」といいます。）が回答を行うことによって実施されるものとします。
            </li>
          </ol>
        </p>
      </div>

      <div>
        <h3 className="text-lg font-semibold mb-3">
          第2条 <span className="ml-2">ユーザーの資格</span>
        </h3>
        <p className="text-gray-700">
          <ol className="list-decimal list-outside space-y-2 text-gray-700 ml-4">
            <li>
              当社の定めるユーザー資格は、本規約を承諾の上、所定の入会手続きを全て完了し、当社からIDおよびパスワードの交付を受けた時点で有効に発行されるものとします
            </li>
            <li>
              前項の定めに拘わらず、当社が本規約その他諸規定等に基づきユーザーとして承認することを不適当と判断した場合、当社は、IDとパスワードの交付後であってもユーザー資格の取り消しを行うことができるものとします。
            </li>
          </ol>
        </p>
      </div>

      <div>
        <h3 className="text-lg font-semibold mb-3">
          第3条 <span className="ml-2">IDおよびパスワードの管理</span>
        </h3>
        <p className="text-gray-700">
          <ol className="list-decimal list-outside space-y-2 text-gray-700 ml-4">
            <li>
              ユーザーは、ユーザー登録後本サイトを利用する場合には、入会手続き完了後に当社から交付されるIDおよびパスワードを使用するものとします。
            </li>
            <li>
              ユーザーは、自己のID、パスワードおよびユーザーの指定する第三者が本サービスを受ける目的として当社が専用に発行するID、パスワードの管理とその使用について一切の責任を負うものとします。
            </li>
            <li>
              ユーザーは、前条所定のIDおよびパスワードを譲渡、売買、貸与その他これに類する行為を行ってはならないものとします。
            </li>
            <li>
              当社は、ユーザーまたは第三者による前条所定のIDおよびパスワードの使用、管理等に関連して生じた一切の損害について、当該使用、管理等に関する故意過失の有無に拘わらず、一切の責任を負わないものとします。
            </li>
          </ol>
        </p>
      </div>

      <div>
        <h3 className="text-lg font-semibold mb-3">
          第4条 <span className="ml-2">ユーザーの登録情報</span>
        </h3>
        <p className="text-gray-700">
          <ol className="list-decimal list-outside space-y-2 text-gray-700 ml-4">
            <li>
              ユーザーは、ユーザー登録の際に申告する登録情報の全ての項目（以下、「ユーザー情報」といいます。）に関して、いかなる虚偽の申告も行ってはならないものとします。
            </li>
            <li>
              ユーザーは、ユーザー登録後、当社が定期的に行う登録情報の更新手続きに関して、当社が別途定める期間内に当該更新手続きを行うものとします。
            </li>
          </ol>
        </p>
      </div>

      <div>
        <h3 className="text-lg font-semibold mb-3">
          第5条 <span className="ml-2">ユーザー情報の管理</span>
        </h3>
        <p className="text-gray-700">
          <ol className="list-decimal list-outside space-y-2 text-gray-700 ml-4">
            <li>
              当社は、ユーザー情報の管理について、主旨に則り厳重にこれを行うものとし、情報の改ざん、漏えい、不正アクセスが起きないよう、予防および安全対策を講じるものとします。
            </li>
            <li>
              当社は、ユーザー情報を、本サービスに関するお知らせの通知、発送等当社のサービスについて紹介するために利用することができます。また、当社は、ユーザー情報を以下の目的で利用することができます。
              <ol className="list-[lower-alpha] space-y-2 text-gray-700 ml-6 mt-1">
                <li>
                  本サービスの運営（当社からユーザーに対するあらゆる分野の情報提供を含みます。）
                </li>
                <li>
                  当社がユーザーに有益と判断した当社、広告主企業、提携先企業などの商品、サービス等に関する情報の提供
                </li>
                <li>
                  個人を特定できないよう統計的に処理した上で、ビッグデータ解析サービスをはじめとする当社の提供サービスに活用または販売
                </li>
                <li>マーケティングリサーチ等の実施、研究、分析のため</li>
                <li>広告、検証、キャンペーンのため</li>
                <li>本人確認のための認証および不正利用防止のため</li>
                <li>個人情報の取扱いに関する連絡</li>
                <li>前各号に付帯または関連する事項</li>
              </ol>
            </li>
            <li>
              当社は、以下のユーザー情報を取得します。 取得項目
              <div className="ml-2">
                お名前、生年月日、メールアドレス、出生国、居住国、雇用状況、業種、
                　会社名、その他アンケート作成に係る情報等
              </div>
            </li>
            <li>
              当社は、ユーザーに関する次の情報を、本サービスにかかわる業務の委託先または提携先に提供する場合があります。ただし、これらの情報により、委託先において、ユーザー本人の特定をすることはできません。
              <ol className="list-[lower-alpha] space-y-2 text-gray-700 ml-6 mt-1">
                <li>ユーザー情報</li>
                <li>アンケートURL</li>
                <li>回答画面URL</li>
                <li>回答画面プレビューURL（設問内容）</li>
                <li>リサーチ対象国</li>
                <li>アンケート回答数（各種細かなデータも含みます）</li>
                <li>設問数</li>
              </ol>
            </li>
            <li>
              当社は、ユーザー情報を個人情報として当社が別途定める『プライバシーポリシー』（2025年9月1日策定）に基づき管理するものとし、次の場合を除き、あらかじめユーザーの同意を得ることなく、当該情報を第三者に提供しないものとします。
              <ol className="list-[lower-alpha] space-y-2 text-gray-700 ml-6 mt-1">
                <li>法令に基づく場合</li>
                <li>
                  人の生命、身体または財産の保護のために必要がある場合であって、ユーザー本人の同意を得ることが困難であるとき
                </li>
                <li>
                  公衆衛生の向上または児童の健全な育成の推進のために特に必要がある場合であって、ユーザー本人の同意を得ることが困難であるとき
                </li>
                <li>
                  国の機関もしくは地方公共団体またはその委託を受けた者が法令の定める事務を遂行することに対して協力する必要がある場合であって、ユーザー本人の同意を得ることにより当該事務の遂行に支障を及ぼすおそれがあるとき
                </li>
              </ol>
            </li>
          </ol>
        </p>
      </div>

      <div>
        <h3 className="text-lg font-semibold mb-3">
          第6条 <span className="ml-2">ユーザーの禁止事項</span>
        </h3>
        <p className="text-gray-700">
          当社は、ユーザーの以下の行為について禁止いたします。以下のいずれかに該当する行
          為があった場合、何らの催告を要することなく、直ちにユーザー資格を抹消することができるものとします。
          当社がユーザー資格を抹消した場合、ユーザーに損害が生じたとしても、当社は一切の賠償責任を負わないものとします。
          <ol className="list-decimal list-outside space-y-2 text-gray-700 ml-4">
            <li>公序良俗に反する行為</li>
            <li>法令、本規約その他当社が定める諸規定に違反する行為</li>
            <li>
              当社、他のユーザーまたは第三者に不利益または損害を与えることを目的とした行為
            </li>
            <li>本サイトにより利用しうる情報を改竄する行為</li>
            <li>本サービスの運営を妨害する行為</li>
            <li>
              当社が承認していない次のような本サービス内における営業活動またはその性格を有するおそれのある行為
              <ol className="list-[lower-alpha] space-y-2 text-gray-700 ml-6 mt-1">
                <li>アンケート目的以外の目的での利用</li>
                <li>リクルーティング目的での利用</li>
                <li>本サービス外への誘導</li>
                <li>広告またはプロモーション目的での利用</li>
                <li>「オープン形式アンケート」以外での個人情報の聴取</li>
              </ol>
            </li>
            <li>
              本サービスを利用して以下に掲げる事項を配信、表示、掲載、または聴取する行為
              <ol className="list-[lower-alpha] space-y-2 text-gray-700 ml-6 mt-1">
                <li>
                  違法、有害、嫌がらせ、不法行為、中傷、迷惑行為、プライバシーの侵害にあたる内容を含むもの
                </li>
                <li>下品、卑猥、ポルノ写真、その他猥褻な内容を含むもの</li>
                <li>暴力、虐待、脅迫、中傷、グロテスクな内容を含むもの</li>
                <li>
                  人種・信条・性別・職業・境遇などによる差別的な表現が含まれるもの
                </li>
                <li>
                  いじめ・自殺の助長、または未成年者に何らかの害を与える内容を含むもの
                </li>
                <li>特定の企業や店舗またはそのユーザーを誹謗中傷するもの</li>
                <li>マルチ商法、ねずみ講等の勧誘を目的とする内容を含むもの</li>
                <li>宗教信仰による布教活動・寄付金募集を目的とするもの</li>
                <li>選挙活動、政治活動その他これらに類する内容のもの</li>
                <li>
                  チェーンレター、ウイルス、スパムメールに該当すると当社が判断するもの、その他迷惑メールに類する内容を含むもの
                </li>
                <li>
                  その他、アンケート回答者が不快に感じる画像、表現などを含むもの
                </li>
                <li>クレジットカード番号、暗証番号などを聴取する内容のもの</li>
                <li>
                  人種、民族、門地、本籍地（所在都道府県に関する情報を除きます。）、身体・精神障害、犯罪歴その他社会的差別の原因となるものを聴取するもの
                </li>
                <li>
                  勤労者の団結権、団体交渉その他団体行動の行為に関するものを聴取するもの
                </li>
                <li>
                  集団示威行為への参加、請願権の行使その他の政治的権利の行使に関するものを聴取するもの
                </li>
                <li>
                  要配慮個人情報（個人情報の保護に関する法律第２条第３項に定めるものをいいます。）を聴取するもの
                </li>
                <li>
                  他人の名義や写真、肖像、商標、著作物、知的財産権等を許可無く利用したもの
                </li>
                <li>
                  企業の秘密情報、インサイダー情報等の開示に該当するおそれのある情報
                  を聴取するもの
                </li>
              </ol>
            </li>
            <li>
              本サービスに関する料金などの支払債務の履行遅延その他の不履行があった場合
            </li>
            <li>
              その他、当社が本サービスを運営するにあたり不適当と判断した場合
            </li>
          </ol>
        </p>
      </div>

      <div>
        <h3 className="text-lg font-semibold mb-3">
          第7条 <span className="ml-2">登録内容の変更</span>
        </h3>
        <p className="text-gray-700">
          ユーザーは、ユーザー情報に変更があった場合、すみやかにその旨を当社が指定する方法により届け出るものとします。
        </p>
      </div>

      <div>
        <h3 className="text-lg font-semibold mb-3">
          第8条 <span className="ml-2">登録の抹消</span>
        </h3>
        <p className="text-gray-700">
          <ol className="list-decimal list-outside space-y-2 text-gray-700 ml-4">
            <li>
              当社は、最後のアンケート調査実施日から2年以上経過、または登録かつサービス未利用から2年以上経過したユーザーを、ユーザーの承諾の有無にかかわらず、ユーザー情報を抹消できるものとします。
            </li>
            <li>
              当社は、合理的に不正（Botの利用等）の疑いがあると判断した場合、当該ユーザーの報酬を停止または失効させることができます。また、当社の判断で不正があると判断されたユーザーを、ユーザーの承諾の有無に関わらずユーザー情報を抹消できるものとします。
            </li>
            <li>
              登録抹消によってユーザーに不利益が発生した場合にも、当社は賠償責任を負いません。
            </li>
            <li>
              ユーザーがクレジットを保有している場合でも、第一項に従い抹消を行います。また、登録の抹消に伴うクレジットの返金等は行いません。
            </li>
          </ol>
        </p>
      </div>

      <div>
        <h3 className="text-lg font-semibold mb-3">
          第9条 <span className="ml-2">退会</span>
        </h3>
        <p className="text-gray-700">
          ユーザーは、退会する場合、所定の手続きに従い当社に届け出るものとし、当社は、当該ユーザーの退会手続き完了後、登録情報を削除するものとします。
        </p>
      </div>

      <div>
        <h3 className="text-lg font-semibold mb-3">
          第10条 <span className="ml-2">秘密保持</span>
        </h3>
        <p className="text-gray-700">
          <ol className="list-decimal list-outside space-y-2 text-gray-700 ml-4">
            <li>
              ユーザーは、本サービスの利用にあたり当社より開示を受けた技術上または営業上その他業務上の秘密に関する情報（当社が特に秘密として指定した情報のみならず、性質上当然に秘密に取り扱う必要がある情報を含み、以下、「秘密情報」といいます。）を第三者に開示または漏洩してはなりません。但し、次の各号のいずれかに該当する情報についてはこの限りではありません。
              <ol className="list-[lower-alpha] space-y-2 text-gray-700 ml-6 mt-1">
                <li>当社による開示前から公知であった情報</li>
                <li>当社から開示される以前にすでに正当に保有していた情報</li>
                <li>
                  当社から開示された後、自己の責に帰すべき事由によらず公知となった情報
                </li>
                <li>
                  第三者から、秘密保持義務を負うことなく、適法に入手した情報
                </li>
                <li>
                  当社から開示された情報を使用することなく、独自に開発した情報
                </li>
              </ol>
            </li>
            <li>
              個人情報は、前項各号の規定にかかわらず秘密情報に含まれるものとします。
            </li>
            <li>
              ユーザーは、秘密情報の管理に必要な措置を講ずるものとし、当該秘密情報を第三者に開示する場合は、事前に当社からの書面による承諾を受けなければなりません。但し、法令の定めに基づきまたは権限ある官公署から開示の要求があった場合はこの限りではありません。
            </li>
            <li>
              ユーザーは、秘密情報について、本サービスの利用に必要な範囲でのみ使用し、複製（バックアップを除きます。）、これら以外の使用をする場合、事前に当社から書面による承諾を受けなければなりません。
            </li>
          </ol>
        </p>
      </div>

      <div>
        <h3 className="text-lg font-semibold mb-3">
          第11条 <span className="ml-2">損害賠償</span>
        </h3>
        <p className="text-gray-700">
          <ol className="list-decimal list-outside space-y-2 text-gray-700 ml-4">
            <li>
              ユーザーが本規約に違反したことにより、またはユーザーの責に帰すべき事由により当社に損害が生じた場合、ユーザーはその損害を賠償するものとします。
            </li>
            <li>
              天災その他、ユーザーおよび当社のいずれの責にも帰することのできない不可抗力により損害が生じた場合、ユーザーおよび当社は、別途協議のうえ対応を決定するものとします。
            </li>
          </ol>
        </p>
      </div>

      <div>
        <h3 className="text-lg font-semibold mb-3">
          第12条 <span className="ml-2">著作権</span>
        </h3>
        <p className="text-gray-700">
          当社が本サービスにおいて提供するシステム、ソフトウェア、アプリケーション、モジュール等に関する著作権等の知的財産権、その他一切の権利は、当社に帰属するものとします。これらを当社の許諾なしに加工、改変、編集、複製、転載、第三者への販売、譲渡、貸与、占有の移転をしてはならないものとします。
        </p>
      </div>

      <div>
        <h3 className="text-lg font-semibold mb-3">
          第13条 <span className="ml-2">反社会的勢力の排除</span>
        </h3>
        <p className="text-gray-700">
          <ol className="list-decimal list-outside space-y-2 text-gray-700 ml-4">
            <li>
              当社およびユーザーは、次の各号に定める事項を現在および将来にわたって表明し、保証するものとします。
              <ol className="list-[lower-alpha] space-y-2 text-gray-700 ml-6 mt-1">
                <li>
                  自らが暴力団（暴力団員による不当な行為の防止等に関する法律（以下、｢暴排法｣といいます。）第2条第2号に規定する暴力団をいいます。）、暴力団員（第2条第6号に規定する暴力団員をいいます。）、暴力団準構成員、暴力団関係企業、総会屋等、社会運動等標榜ゴロまたは特殊知能暴力集団その他暴力、威力、詐欺的手法を用いて暴力的不法行為等（第2条第1号に規定する行為をいいます。）を常習的に行う、または自らの目的を達成することを常習とする集団または個人（以下、併せて「反社会的勢力」といいます。）に該当しないこと
                </li>
                <li>
                  自己の代表者、役員または主要な職員（雇用形態および契約形態を問いません。）が反社会的勢力に該当しないこと
                </li>
                <li>
                  自己の主要な出資者その他経営を支配していると認められる者が反社会的勢力に該当しないこと
                </li>
                <li>
                  直接、間接を問わず、反社会的勢力が自己の経営に関与していないこと
                </li>
                <li>
                  自己もしくは第三者の不正の利益を図る目的または第三者に損害を加える目的をもってするなど、不当に反社会的勢力を利用していると認められる関係を有していないこと
                </li>
                <li>
                  反社会的勢力に対して資金等の提供ないし便宜の供与等をしていないこと
                </li>
                <li>
                  自己の代表者、役員または経営に実質的に関与している者が反社会的勢力と社会的に非難されるべき関係を有していないこと
                </li>
              </ol>
            </li>
            <li>
              当社およびユーザーは、自らまたは第三者をして次の各号に定める行為を行ってはなりません。
              <ol className="list-[lower-alpha] space-y-2 text-gray-700 ml-6 mt-1">
                <li>
                  相手方または第三者に対する暴排法第9条各号に定める暴力的要求行為
                </li>
                <li>
                  相手方または第三者に対する法的な責任を超えた不当な要求行為
                </li>
                <li>
                  相手方または第三者に対する、脅迫的な言動または暴力を用いる行為
                </li>
                <li>
                  偽計または威力を用いて、相手方または第三者の業務を妨害し、または信用を毀損する行為
                </li>
              </ol>
            </li>
            <li>
              当社およびユーザーは、第1項または第2項の規定に違反している事実が判明した場合、直ちに相手方にその事実を報告するものとします。
            </li>
            <li>
              当社およびユーザーは、相手方による第1項および第2項の規定の遵守状況に関する必要な調査を行うことができるものとします。この場合、相手方は当該調査に協力し、これに必要な資料を提出しなければなりません。
            </li>
            <li>
              当社およびユーザーは、相手方が第1項または第2項の規定に違反している事実が判明した場合、何らの催告なしに、当社とユーザー間で締結されたすべての契約の全部または一部を解除（利用停止および登録の抹消を含みます。）し、かつ、相手方に対して反社会的勢力の排除のために必要な措置を講ずるよう請求することができます。
            </li>
            <li>
              前項の規定により、相手方から当社とユーザー間で締結された契約を解除された場合または反社会的勢力の排除のために必要な措置を講ずるよう請求された場合、当該規定に違反した当事者は、相手方に対し、その名目を問わず、当該解除または措置に関し生じた損害および費用の一切の請求をしないものとします。
            </li>
            <li>
              当社およびユーザーは、相手方が第1項または第2項の規定に違反したことにより損害を被った場合、相手方に対して、当該損害一切の賠償を請求することができるものとします。
            </li>
          </ol>
        </p>
      </div>

      <div>
        <h3 className="text-lg font-semibold mb-3">
          第14条 <span className="ml-2">通知</span>
        </h3>
        <p className="text-gray-700">
          <ol className="list-decimal list-outside space-y-2 text-gray-700 ml-4">
            <li>
              本サイトの利用および本規約に基づく当社からユーザー宛の諸通知は、ユーザーが申告したＥメールアドレスに当社が発信する方法または当社が別途定める方法によりこれを行うものとします。
            </li>
            <li>
              ユーザーは、申告したＥメールアドレスその他の登録情報を必要に応じて変更せずこれを怠った場合、当社からの諸通知または送付書類等が延着または不到達となっても、当社が通常到達すべきときに到達したものとみなすことに異議がないものとします。
            </li>
          </ol>
        </p>
      </div>

      <div>
        <h3 className="text-lg font-semibold mb-3">
          第15条 <span className="ml-2">アンケート等の削除</span>
        </h3>
        <p className="text-gray-700">
          <ol className="list-decimal list-outside space-y-2 text-gray-700 ml-4">
            <li>
              当社は、終了から2年以上が経過したアンケートを順次削除します。
            </li>
            <li>
              当社は、ユーザーが本サービスの利用を終了した場合（第6条もしくは第8条に基づく抹消または第9条に基づく退会のいずれであるかを問いません。）において、終了時点で本サービス上または当社のサーバー上に登録または格納されている当該ユーザーに関する情報を、ユーザーに対する通知をすることなく、削除することができるものとします。
            </li>
            <li>
              当社が前各項の規定に基づき削除を行ったことにより、ユーザーに損害が生じたとしても、当社は一切の損害賠償義務を負担しないものとします。
            </li>
          </ol>
        </p>
      </div>

      <div>
        <h3 className="text-lg font-semibold mb-3">
          第16条 <span className="ml-2">免責事項</span>
        </h3>
        <p className="text-gray-700">
          <ol className="list-decimal list-outside space-y-2 text-gray-700 ml-4">
            <li>
              ユーザーは、本サービスを通じて実施する調査について、自己の責任においてこれを実施するものとし、当社は、本サービスを通じてユーザーが実施する調査の内容に関連して生じた損害について一切の責任を負わないものとします。
            </li>
            <li>
              当社は、本サービスにより当社がユーザーに提供し、またはユーザーが自ら収集、取得した調査結果に基づきユーザーが実施した一切の行為についてその責任を負わないものとします。
            </li>
            <li>
              ユーザーは、本サービスに実装される翻訳機能を自己の責任において利用するものとし、当社は、当該翻訳機能による翻訳結果について、正確性、完全性その他何らの保証もしないものとし、当該翻訳結果に起因してユーザーに生じた損害について一切の責任を負わないものとします。
            </li>
            <li>
              ユーザーは、本サービスの利用に関連し、他のユーザーまたは第三者に対して損害を与えたものとして、当該ユーザーまたは第三者から何らかの請求がなされ、または訴訟が提起された場合、ユーザーは自らの費用と責任において当該請求および訴訟を解決するものとし、当社は一切の責任を負わないものとします。また、ユーザーが本
              規約に違反して本サービスを利用した場合で、当社が他のユーザーまたは第三者
              に損害賠償等の支払を余儀なくされた場合には、違反したユーザーはその全額を
              当社に支払うとともに、その解決のために要した弁護士費用その他一切の諸経費
              を当社に支払うものとします。
            </li>
            <li>
              当社のユーザーに対する賠償責任は、ユーザーに直接生じた通常の損害に限り、ユーザーが本サービスの対価として当該損害発生の直近6ヶ月間に当社に対して支払った金額の総額を限度とするものとし、逸失利益、特別な事情により生じた損害等については、免責されるものとします。
            </li>
          </ol>
        </p>
      </div>

      <div>
        <h3 className="text-lg font-semibold mb-3">
          第17条{" "}
          <span className="ml-2">
            本サービスの内容の変更ならびに本サービスの一時中断、停止および終了
          </span>
        </h3>
        <p className="text-gray-700">
          <ol className="list-decimal list-outside space-y-2 text-gray-700 ml-4">
            <li>
              当社は、本サービスの稼動状態を良好に保つために、次の各号に該当する場合、ユーザーに対して事前に通知を行うことなく、本サービスの全部もしくは一部の変更または本サービスの提供の全部もしくは一部を停止または終了することができるものとします。
              <ol className="list-[lower-alpha] list-outside space-y-2 text-gray-700 ml-4">
                <li>
                  本サービスを提供するための装置、システムの保守点検や更新のために必要な場合
                </li>
                <li>
                  火災、停電、第三者による妨害行為などにより本サービスの提供が困難になった場合
                </li>
                <li>
                  本サービスの通信に係る事業者による通信回線の提供が中断、停止され、本サービスの提供が困難となった場合
                </li>
                <li>
                  裁判所、その他公的機関からの要請または法令に基づき本サービスの一時中断、停止または終了を命じられた場合
                </li>
                <li>
                  その他、やむを得ず本サービスの全部または一部の一時中断、または停止が必要であると当社が判断した場合
                </li>
              </ol>
            </li>
            <li>
              前項に定める場合の他、当社は、1ヶ月以上前から、ユーザーに対し、第14条に定める方法により通知することにより、本サービスの全部または一部の提供を終了することができるものとします。
            </li>
            <li>
              前各項に基づく本サービスの内容の変更または、一時中断、停止もしくは終了によってユーザーに不利益または損害が発生した場合においても、当社は一切の責任を負わないものとします。
            </li>
            <li>
              当社が第一項または第二項に基づき本サービスの提供を終了した場合、各種キャンペーン等、当社からの付与にて獲得したクレジットを除き、未使用分のクレジットを1クレジット=1円で返金します。
            </li>
          </ol>
        </p>
      </div>

      <div>
        <h3 className="text-lg font-semibold mb-3">
          第18条 <span className="ml-2">本規約等の変更</span>
        </h3>
        <p className="text-gray-700">
          <ol className="list-decimal list-outside space-y-2 text-gray-700 ml-4">
            <li>
              当社は、法令等に基づきユーザーの事前の承諾を得ることが必要となる場合を除き、本規約(当社ウェブサイトに掲載する本サービスに関するルール、諸規定等を含みます。以下、本条において同様とします。)または本サービスの内容を自由に変更できるものとします。なお、本規約または本サービスの内容を変更する場合(本
              サ―ビスの内容の軽微な変更を行う場合を除きます。)、当社は、事前に当社のウェブサイトへの掲載その他当社が適切と判断する方法により周知するものとします。
            </li>
            <li>
              当社は、本規約または本サービスの内容を変更した場合、前項に定める通知において指定された期日以降に、ユーザーが本サービスにログインした場合には、ユーザーは、本規約または本サービスの内容の変更に同意したものとみなします。
            </li>
          </ol>
        </p>
      </div>

      <div>
        <h3 className="text-lg font-semibold mb-3">
          第19条 <span className="ml-2">準拠法及び管轄裁判所</span>
        </h3>
        <p className="text-gray-700">
          本規約の準拠法は日本法とし、本規約に起因し、または関連する一切の紛争については、東京簡易裁判所または東京地方裁判所を第一審の専属的合意管轄裁判所とします。
        </p>
      </div>

      <div>
        <h3 className="text-lg font-semibold mb-3">
          第20条 <span className="ml-2">協議解決</span>
        </h3>
        <p className="text-gray-700">
          当社およびユーザーは、本規約に定めのない事項または本規約の解釈に疑義が生じた場合には、互いに信義誠実の原則に従って協議の上速やかに解決を図るものとします。
        </p>
      </div>

      <div className="text-right">以上</div>
    </div>
  );
}
